prototype/app/Services/CategoryService.php

        public function getAll()
    {
        return Category::all();
---
select * from `categories`