prototype/app/Services/ProductService.php

    public function getAll()
    {
        return $this->product->with('categories')->latest()->get();
---
select `categories`.*, `category_product`.`product_id` as `pivot_product_id`, `category_product`.`category_id` as `pivot_category_id` from `categories` inner join `category_product` on `categories`.`id` = `category_product`.`category_id` where `category_product`.`product_id` in (1, 2, 3, 4, 5)